#[derive(Debug, PartialEq, Eq, Hash)]
pub enum PaperNote {
    D43,
    D3,
    D32,
    D2,
    D21,
    D1,
    M01,
    M1,
    M12,
    M2,
    M23,
    M3,
    M34,
    M4,
    M45,
    M5,
    M56,
    U1,
    U12,
    U2,
    U23,
    U3,
    U34,
}

impl PaperNote {
    pub fn placement(&self) -> String {
        use PaperNote::*;
        let place = match self {
            D43 => "под 3 нижней добавочной линией",
            D3 => "на 3 нижней добавочной линии",
            D32 => "между 3 и 2 нижней добавочной линией",
            D2 => "на 2 нижней добавочной линии",
            D21 => "между 2 и 1 нижней добавочной линией",
            D1 => "на 1 нижней добавочной линии",
            M01 => "под 1 линией",
            M1 => "на 1 линии нотоносца",
            M12 => "между 1 и 2 линиями",
            M2 => "на 2 линии нотоносца",
            M23 => "между 2 и 3 линиями",
            M3 => "на 3 линии",
            M34 => "между 3 и 4 линиями",
            M4 => "на 4 линии",
            M45 => "между 4 и 5 линиями",
            M5 => "на 5 линии",
            M56 => "над 5 линией",
            U1 => "на 1 верхней добавочной линии",
            U12 => "между 1 и 2 верхней добавочной линией",
            U2 => "на 2 верхней добавочной линии",
            U23 => "между 2 и 3 верхней добавочной линией",
            U3 => "на 3 верхней добавочной линии",
            U34 => "над 3 верхней добавочной линией",
        };
        place.to_string()
    }

    pub fn name(&self) -> String {
        use PaperNote::*;
        let note = match self {
            D43 | M1 | M45 | U3 => "E",
            D3 | M12 | M5 | U34 => "F",
            D32 | M2 | M56 => "G",
            D2 | M23 | U1 => "A",
            D21 | M3 | U12 => "B",
            D1 | M34 | U2 => "C",
            M01 | M4 | U23 => "D",
        };
        note.to_string()
    }

    pub fn name_ru(&self) -> String {
        use PaperNote::*;
        let note = match self {
            D43 | M1 | M45 | U3 => "ми",
            D3 | M12 | M5 | U34 => "фа",
            D32 | M2 | M56 => "соль",
            D2 | M23 | U1 => "ля",
            D21 | M3 | U12 => "си",
            D1 | M34 | U2 => "до",
            M01 | M4 | U23 => "ре",
        };
        note.to_string()
    }
}
